{"wrapper":"div.faqs-page","sections":{"main":{"type":"faq-page","blocks":{"1ecf4d3c-1dfd-45d7-88d2-ec0a35229b03":{"type":"text","settings":{"question_faqs_1":"What materials do you use to design ICECROWNS Jewelry?","answer_faqs_1":"ICECROWNS jewelry is made of brass\/stainless steel with a 14k\/18k gold plating paved with Cubic Zirconia stones (CZ). CZ stones are a manufactured crystalline material that is used as an alternative to diamonds. The synthetic substance is colorless, rigid and immaculate. Today, cubic zirconia is one of the most popular stones used in jewelry to produce eye-catching yet affordable prices.\n<br>All of our jewelry pieces are extensively tested for quality and durability before, during and after manufacturing.","question_faqs_2":"How long will the gold plating on ICECROWNS Jewelry remain intact?","answer_faqs_2":"Even though gold plating is designed to be everlasting, it doesn't stand up well to rough treatment. Over the years, gold plating deteriorates and may peel off, revealing the primary metal beneath. Plating may last up to three to four years with adequate maintenance.\n<br><br><b>ICECROWNS<\/b> tries to make sure the gold plating will last forever.<br> Every single piece of our jewelry is plated five times using premium electroplating and painting.","question_faqs_3":"Does ICECROWNS Jewelry withstand water?","answer_faqs_3":"The short answer is yes, with a limit. ICECROWNS jewelry pieces are made from premium materials and thoroughly tested. Showering or swimming while wearing gold-plated jewelry might eventually, over the years, result in the gold plating wearing off. <br><br>Therefore, we recommend you to avoid doing it.","question_faqs_4":"How should ICECROWNS Jewelry be cared for?","answer_faqs_4":"You can lengthen the life of gold-plated jewelry and maintain its luster and beauty by giving it the necessary maintenance. <br><br>\nKeep cosmetics, oils, and chemicals away from gold-plated jewelry. Always put on your plated jewelry last, following the application of perfume, hairspray, and makeup. Take off any gold-plated jewelry before performing chores since the chemicals in soap, detergent, and cleaners might damage the plating. <br><br>\nAvoid exposing gold-plated jewelry to saltwater or chlorinated water. By doing this, you should avoid wearing jewelry when swimming in seas, hot tubs, or pools.<br><br>\nGold plating may be damaged by sweat. This may be avoided by routinely cleaning or wiping down jewelry to remove impurities.<br><br>\nIt's crucial to routinely clean your gold-plated jewelry if you want to extend its lifespan. When doing this, use a light liquid soap or a commercial jewelry cleaning solution. Avoid using any harsh cleansers or strong chemicals. Avoid touching or scratching the plated jewelry since doing so might cause it to peel and reveal the metal below.<br><br>\nAvoid rubbing and friction with gold-plated jewelry to prevent rapid deterioration and peeling. When wearing many pieces of gold-plated jewelry, they may rub against one another and cause this. The jewelry should ideally be worn by itself.<br><br>","question_faqs_5":"","answer_faqs_5":""}},"44484dfc-4fe0-49ce-8ce4-8249083fb097":{"type":"text","settings":{"question_faqs_1":"How do I track my order?","answer_faqs_1":"You can log into your account through our online store, access your account order history. The tracking number should be attached to the order.\nYou can also visit the <b><a href=\"https:\/\/icecrowns.com\/tools\/track-your-order\">Track Your Order<\/a><\/b> page where you need to input your order number and email or the tracking number corresponding to your order.\n<br><br>\nA shipment confirmation will also be sent to you as soon as your order has been processed. After that, using the email's track link, you may follow the progress of your order. Don't worry if you haven't yet gotten an email. The shipping of your item typically takes 24 to 48 hours, and it may take an additional 24 to 48 hours for the tracking number to be updated.","question_faqs_2":"Can I change my order?","answer_faqs_2":"Once the order has been shipped, we are unable to make any modifications to your purchase. We cannot be held liable if the order is lost if you enter the incorrect address during checkout. We are not obligated to replace or refund the order, although you can contact us at <b>support@icecrowns.com<\/b> to discuss this further.","question_faqs_3":"I received the wrong jewelry piece. What should I do?","answer_faqs_3":"In the unlikely scenario that you received the incorrect item, please get in touch with us at <b>support@icecrowns.com<\/b> with the order number, name of the piece you did not receive, name and a detailed image of the piece you received, so that we can handle this for you promptly.","question_faqs_4":"There is a jewelry piece missing from my order. What should I do?","answer_faqs_4":"In the unlikely scenario that you received the incorrect item, please get in touch with us at <b>support@icecrowns.com<\/b> with your order number and the name of the item you haven't received, so that we can handle this for you promptly.","question_faqs_5":"","answer_faqs_5":""}},"f81bf414-6295-400b-984a-35e56a9923e9":{"type":"text","settings":{"question_faqs_1":"How can I return my order?","answer_faqs_1":"ICECROWNS offers a 14-day return & 30-day exchange policy. We want you to wear with love your purchased jewelry piece. That's why, if you are not completely satisfied, you may return or exchange the unused item in its original condition as long as you contact us at <b>support@icecrowns.com<\/b> within 14 days from the time of receipt or 30 days in case you want an exchange.\n<br>\n<br>\nTo start a return or exchange, you can contact us at <b>support@icecrowns.com<\/b>. If your return or exchange request is accepted, we'll send you a return shipping label, as well as instructions on how and where to send your package. You need to carefully package the piece you are returning in its original packaging along with any other tags you received.\n<br>\nFor more information, check the <b><a href=\"https:\/\/icecrowns.com\/policies\/refund-policy\">Return & Exchange policy<\/a><\/b> page.","question_faqs_2":"I have not yet gotten a refund. What should I do?","answer_faqs_2":"If you are approved for a refund, you'll be automatically refunded on your original payment method within 10 business days. Please remember it can take some time for your bank or credit card company to process and post the refund too.","question_faqs_3":"","answer_faqs_3":"","question_faqs_4":"","answer_faqs_4":"","question_faqs_5":"","answer_faqs_5":""}},"383fe220-c5af-4539-ac0a-6fec317a0590":{"type":"text","settings":{"question_faqs_1":"","answer_faqs_1":"","question_faqs_2":"","answer_faqs_2":"","question_faqs_3":"","answer_faqs_3":"","question_faqs_4":"","answer_faqs_4":"","question_faqs_5":"","answer_faqs_5":""}}},"block_order":["1ecf4d3c-1dfd-45d7-88d2-ec0a35229b03","44484dfc-4fe0-49ce-8ce4-8249083fb097","f81bf414-6295-400b-984a-35e56a9923e9","383fe220-c5af-4539-ac0a-6fec317a0590"],"settings":{"des_faqs":"Below FAQ are some common concerns of our clients before purchasing. If you have any other questions, please <b><a href=\"https:\/\/icecrowns.com\/pages\/contact\">Contact Us<\/a><\/b> \nor mail at <b>support@icecrowns.com<\/b>","contact_text":"Unable to find satisfactory answers ?","contact_link_text":"Contact Support","contact_link":"https:\/\/icecrowns.com\/pages\/contact","icon_faqs":"Question","bg_icon_qs":"#7c0000","color_icon_qs":"#ffffff","bg_question":"#1e1c1c","color_question":"#ffffff","font_size_qs":"16","bg_question_acitve":"#232323","color_question_acitve":"#ffffff","icon_answer":"Answer","bg_icon_answer":"#086b05","color_icon_answer":"#ffffff","color_question_answer":"#1e1c1c","font_size_answer":"16","color_question_link":"#7c0000","icon_show":"Show","icon_hide":"Hide"}},"1627964096e7d243b7":{"type":"home-featured-products","disabled":true,"settings":{"bg_color":"","layout_style":"layout_style_1","display_banner":false,"banner_is":"left","banner_heading":"#CAMPAIGNS","font_size_banner_heading":"40px","color_banner_heading":"#ffffff","banner_sub_heading":"Spring Summer’08","font_size_banner_sub_heading":"13px","color_banner_sub_heading":"#ffffff","banner_des":"Phasellus lorem malesuada ligula pulvinar de cosmopolis","font_size_banner_des":"12px","color_banner_des":"#ffffff","banner_button":"Shop Now","link":"","banner_button_2":"Shop Now","link_2":"","bg_banner_button":"#ffffff","border_banner_button":"#ffffff","color_banner_button":"#232323","bg_color_box_style_2":"#ffffff","border_color_box_style_2":"#bcbcbc","featured_products_title":"Trending Now","color_text_title":"","font_size_title":"","text_alignment":"left","featured_products_des":"","featured_products_text_link":"","featured_products_link":"","color_text_link":"#ba7a2d","title_style":"style_1","show_slider_featured_collection":"collection-1","slider_featured_limit_all":10,"collection_results_per_row1":"5","featured_products_title_2":"Trending Now","featured_products_text_link_2":"","featured_products_link_2":"","show_slider_featured_collection_2":"","display_list_collection":false,"text_list":"View all categories","url_list":"","margin_bottom_mb":40,"margin_bottom_tab":40,"margin_bottom":0}}},"order":["main","1627964096e7d243b7"]}